/* 信05 2351050 杨瑞晨 */

/* ----具体要求----
   1、允许添加需要的头文件
   2、不允许定义全局变量、静态局部变量
   3、不允许添加其它函数，但允许添加函数声明 
   ---------------------------------------------------------------------
*/

#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h> 

/***************************************************************************
  函数名称：LCM
  功    能：计算两数的最小公倍数
  输入参数：m, n
  返 回 值：
  说    明：
***************************************************************************/
int LCM(int m, int n)
{
	int max = (m > n) ? m : n;
    int min = (m < n) ? m : n;
    int lcm = max;

    while (1) {
        if (lcm % min == 0) {
            return lcm;
        }
        lcm += max;
    }
	/* 本函数内只允许一句return语句，且不得是逗号表达式 */
}

/***************************************************************************
  函数名称：GCD
  功    能：计算两数的最大公约数
  输入参数：m, n
  返 回 值：
  说    明：
***************************************************************************/
int GCD(int m, int n)
{
	while (n != 0) {
        int temp = n;
        n = m % n;
        m = temp;
    }
    return m;
}

/***************************************************************************
  函数名称：get_int
  功    能：根据no值，打印“请输入出第no个正整数”,读到正整数后返回 
  输入参数：no
  返 回 值：
  说    明：不准修改返回类型、形参
***************************************************************************/
int get_int(int no)
{
	int ret, num;
	while (1) {
		printf("请输入第%d个正整数\n",no);
		ret = scanf("%d", &num);
		if (ret == 0) {
			while (getchar() != '\n')                        //清空输入缓冲区
				;
		}
		else if (num >= 1)
			break;
	}
	return num;
}

/***************************************************************************
  函数名称：
  功    能：
  输入参数：
  返 回 值：
  说    明：只允许修改...部分
***************************************************************************/
int main()
{
	int m, n;

	/* 读入两个正整数 */ 
	m = get_int(1);
	n = get_int(2);

	/* 打印最大公约数和最小公倍数 */ 
	printf("最大公约数 : %d\n", GCD(m, n)); //将...补齐即可 
	printf("最小公倍数 : %d\n", LCM(m, n)); //将...补齐即可

	return 0;
}

